spec/fixtures/files/stripe/event_payment_intent_successful.json

{
  "id": "evt_1GBfSDHwuhGySQCdPgSHbB10",
  "object": "event",
  "api_version": "2019-10-17",
  "created": 1581591717,
  "data": {"object":{"id":"pi_1GBfSBHwuhGySQCdlx2BlG9Y","object":"payment_intent","amount":700,"amount_capturable":0,"amount_received":700,"application":null,"application_fee_amount":null,"canceled_at":null,"cancellation_reason":null,"capture_method":"automatic","charges":{"object":"list","data":[{"id":"ch_1GBfSCHwuhGySQCdGUTi0cs8","object":"charge","amount":700,"amount_refunded":0,"application":null,"application_fee":null,"application_fee_amount":null,"balance_transaction":"txn_1GBfSDHwuhGySQCdgJj31YRF","billing_details":{"address":{"city":null,"country":null,"line1":null,"line2":null,"postal_code":null,"state":null},"email":null,"name":null,"phone":null},"captured":true,"created":1581591716,"currency":"eur","customer":null,"description":"Gift Card 1 months","destination":null,"dispute":null,"disputed":false,"failure_code":null,"failure_message":null,"fraud_details":{},"invoice":null,"livemode":false,"metadata":{"checkout_object":"gift_card"},"on_behalf_of":null,"order":null,"outcome":{"network_status":"approved_by_network","reason":null,"risk_level":"normal","risk_score":29,"seller_message":"Payment complete.","type":"authorized"},"paid":true,"payment_intent":"pi_1GBfSBHwuhGySQCdlx2BlG9Y","payment_method":"pm_1GBfSCHwuhGySQCd0QXl9IsR","payment_method_details":{"card":{"brand":"visa","checks":{"address_line1_check":null,"address_postal_code_check":null,"cvc_check":"pass"},"country":"US","exp_month":4,"exp_year":2024,"fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","installments":null,"last4":"4242","network":"visa","three_d_secure":null,"wallet":null},"type":"card"},"receipt_email":null,"receipt_number":null,"receipt_url":"https://pay.stripe.com/receipts/acct_1A09wWHwuhGySQCd/ch_1GBfSCHwuhGySQCdGUTi0cs8/rcpt_Gj7h67jlY9pdEKXzNaXpOswTSkYmHuN","refunded":false,"refunds":{"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_1GBfSCHwuhGySQCdGUTi0cs8/refunds"},"review":null,"shipping":null,"source":null,"source_transfer":null,"statement_descriptor":null,"statement_descriptor_suffix":null,"status":"succeeded","transfer_data":null,"transfer_group":null}],"has_more":false,"total_count":1,"url":"/v1/charges?payment_intent=pi_1GBfSBHwuhGySQCdlx2BlG9Y"},"client_secret":"pi_1GBfSBHwuhGySQCdlx2BlG9Y_secret_BVhlhC3CE0oxyKdxF7jiX4Ud2","confirmation_method":"automatic","created":1581591715,"currency":"eur","customer":null,"description":"Gift Card 1 months","invoice":null,"last_payment_error":null,"livemode":false,"metadata":{"checkout_object":"gift_card"},"next_action":null,"on_behalf_of":null,"payment_method":"pm_1GBfSCHwuhGySQCd0QXl9IsR","payment_method_options":{"card":{"installments":null,"request_three_d_secure":"automatic"}},"payment_method_types":["card"],"receipt_email":null,"review":null,"setup_future_usage":null,"shipping":null,"source":null,"statement_descriptor":null,"statement_descriptor_suffix":null,"status":"succeeded","transfer_data":null,"transfer_group":null}},
  "livemode": false,
  "pending_webhooks": 0,
  "request": {"id":"req_Tdq9hcMaxpmswq","idempotency_key":null},
  "type": "payment_intent.succeeded"
}
